src/cfe/КСП/InformationRegisters/мис_СтатусВыполненияЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>мис_СтатусВыполненияЗаданий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мис_СтатусВыполнения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИндексЛога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мис_ИндексЛога</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторФон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мис_УправлениеЗаданиями</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/Catalogs/мис_ЛогСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>мис_ЛогСообщений</Name>
			<Comment>Сюда пишутся детальные сообщения лога</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мис_СтатусыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДетальноеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>_Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мис_ИндексЛога</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/мис_СтатусВыполненияЗаданий/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИДВызова = ЗАпись.ИндексЛога;
	Если ЗначениеЗаполнено(ИДВызова) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ИДВызова",ИдВызова);
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛогСообщений.Ссылка КАК Сообщение,
		               |	ЛогСообщений._Владелец КАК Владелец,
		               |	ЛогСообщений.Наименование,
		               |	ЛогСообщений.ВидСообщения КАК ВидСообщения
		               |ИЗ
		               |	Справочник.мис_ЛогСообщений КАК ЛогСообщений
		               |ГДЕ
		               |	ЛогСообщений._Владелец В ИЕРАРХИИ(&ИдВызова)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЛогСообщений._Владелец.ВремяВызова,
		               |	ЛогСообщений.ДатаВремя
		               |ИТОГИ ПО
		               |	Владелец ИЕРАРХИЯ
		               |АВТОУПОРЯДОЧИВАНИЕ";
		Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		
		ЗначениеВДанныеФормы(Дерево,СписокОшибок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Сообщение) Тогда
		ОткрытьЗначение(Элемент.ТекущиеДанные.Сообщение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОтчет(Команда)
	
	мис_ЛоггерКлиент.ОткрытьОтчетПоЛогу(Запись.ИндексЛога);
	
КонецПроцедуры
